app/Controllers/Progress/EduMonthlyController.php

    public function index()
    {
        $yearModel = new YearModel();
        $currentYear = $yearModel->getCurrentYear();

        $selectedMonth = $this->request->getVar('month') ?? date('F');
        $data = [
            'selectedMonth' => $selectedMonth,
            'title' => 'Education Progress',
        ];

        $eduMonthlyModel = new EduMonthlyModel();
        $data['edumonthly'] = $eduMonthlyModel->where([
            'year' => $currentYear,
            'month' => $selectedMonth
        ])->first();
---
SELECT *
FROM `edumonthly`
WHERE `year` = ('2077/078')
AND `month` = 'April'
 LIMIT 1

    public function getMonthData()
    {
        $month = $this->request->getVar('month');
        if ($month) {
            $yearModel = new YearModel();
            $currentYear = $yearModel->getCurrentYear();

            $eduMonthlyModel = new EduMonthlyModel();
            $data = $eduMonthlyModel->where([
                'year' => $currentYear,
                'month' => $month
            ])->first();
---
SELECT *
FROM `edumonthly`
WHERE `year` = ('2077/078')
AND `month` = 'April'
 LIMIT 1