app/Models/YearModel.php

    public function getCurrentYear()
{
    return $this->where('active', 1)
                ->select('year')
                ->first();
---
SELECT `year`
FROM `years`
WHERE `active` = 1
 LIMIT 1